tap "mutagen-io/mutagen"
tap "runpod/runpodctl"
tap "tsung-ju/iguanatexmac"
brew "autojump"
brew "autossh"
brew "bat"
brew "black"
brew "cpanminus"
brew "direnv"
brew "eza"
brew "fd"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "helm"
brew "hf"
brew "isort"
brew "kubernetes-cli", link: false
brew "lazygit"
brew "mise"
brew "mosh"
brew "neovim"
brew "nvm"
brew "parallel"
brew "pkgconf"
brew "poppler"
brew "python@3.11"
brew "ripgrep"
brew "sshpass"
brew "syncthing", restart_service: :changed
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "xcodegen"
brew "zoxide"
brew "zsh"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "codex"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "docker-desktop"
cask "fliqlo"
cask "font-meslo-lg-nerd-font"
cask "heynote"
cask "tsung-ju/iguanatexmac/iguanatexmac"
cask "iterm2"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "tsung-ju/iguanatexmac/latexit-metadata"
cask "miniconda"
cask "obsidian"
cask "skim"
cask "termius"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "durzn.brackethighlighter"
vscode "editorconfig.editorconfig"
vscode "elagil.pre-commit-helper"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "marp-team.marp-vscode"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "necatiarslan.aws-s3-vscode-extension"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
