tap "runpod/runpodctl"
# Shell extension to jump to frequently used directories
brew "autojump"
# Python code formatter
brew "black"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Kubernetes package manager
brew "helm"
# Sort Python imports automatically
brew "isort"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Flip clock screensaver
cask "fliqlo"
# Dedicated scratchpad for developers
cask "heynote"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Minimal installer for conda
cask "miniconda"
# PDF reader and note-taking application
cask "skim"
