tap "runpod/runpodctl"
# Shell extension to jump to frequently used directories
brew "autojump"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Python code formatter
brew "black"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Kubernetes package manager
brew "helm"
# Sort Python imports automatically
brew "isort"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Flip clock screensaver
cask "fliqlo"
cask "font-meslo-lg-nerd-font"
# Dedicated scratchpad for developers
cask "heynote"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Minimal installer for conda
cask "miniconda"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PDF reader and note-taking application
cask "skim"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "durzn.brackethighlighter"
vscode "editorconfig.editorconfig"
vscode "elagil.pre-commit-helper"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mathematic.vscode-latex"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mikoz.black-py"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "natizyskunk.sftp"
vscode "nickfode.latex-formatter"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "rvest.vs-code-prettier-eslint"
vscode "solitechnologyllc.sync-code-cloud"
vscode "spencerjames.ss3sync"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "zainchen.json"
